spec/fixtures/vcr_cassettes/Stripe-v19.3.0/StripePaymentStatus/_stripe_status/when_the_payment_has_a_payment_intent/fetches_the_status_with_Stripe_PaymentIntentValidator.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/payment_methods
    body:
      encoding: UTF-8
      string: type=card&card[number]=4242424242424242&card[exp_month]=12&card[exp_year]=2027&card[cvc]=314
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/19.3.0
      Authorization:
      - "<HIDDEN-AUTHORIZATION-HEADER>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_FEdNOUMUkPYcwK","request_duration_ms":406}}'
      Idempotency-Key:
      - 11df8b1d-784e-41ea-976e-013007b7b8de
      Stripe-Version:
      - 2026-06-24.dahlia
      X-Stripe-Client-User-Agent:
      - "<HIDDEN-STRIPE-USER-AGENT>"
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 17 Jul 2026 00:07:09 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1123'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=-AsR8-QoUz5vPqfjpWoX3LXqvm03tVT2tko6dgREouaydBH7ad4ePu_DivmkdBtYlprnrjpF1OLphVYd;
        report-to csp
      Idempotency-Key:
      - 11df8b1d-784e-41ea-976e-013007b7b8de
      Original-Request:
      - req_EDY0YZpJDp8N51
      Report-To:
      - '{"group":"csp","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/csp-report-v2?q=-AsR8-QoUz5vPqfjpWoX3LXqvm03tVT2tko6dgREouaydBH7ad4ePu_DivmkdBtYlprnrjpF1OLphVYd&t=1"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - csp="https://q.stripe.com/csp-report-v2?q=-AsR8-QoUz5vPqfjpWoX3LXqvm03tVT2tko6dgREouaydBH7ad4ePu_DivmkdBtYlprnrjpF1OLphVYd&t=1"
      Request-Id:
      - req_EDY0YZpJDp8N51
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - 2026-06-24.dahlia
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - 3c3
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pm_1TtzJ3KuuB1fWySndZ3Z2jpK",
          "object": "payment_method",
          "allow_redisplay": "unspecified",
          "billing_details": {
            "address": {
              "city": null,
              "country": null,
              "line1": null,
              "line2": null,
              "postal_code": null,
              "state": null
            },
            "email": null,
            "name": null,
            "phone": null,
            "tax_id": null
          },
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "unchecked"
            },
            "country": "US",
            "display_brand": "visa",
            "exp_month": 12,
            "exp_year": 2027,
            "fingerprint": "6E6tgVjx6U65iHFV",
            "funding": "credit",
            "generated_from": null,
            "last4": "4242",
            "networks": {
              "available": [
                "visa"
              ],
              "preferred": null
            },
            "regulated_status": "unregulated",
            "three_d_secure_usage": {
              "supported": true
            },
            "wallet": null
          },
          "created": 1784246829,
          "customer": null,
          "customer_account": null,
          "livemode": false,
          "metadata": {},
          "shared_payment_granted_token": null,
          "type": "card"
        }
  recorded_at: Fri, 17 Jul 2026 00:07:57 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/payment_intents
    body:
      encoding: UTF-8
      string: amount=100&currency=aud&payment_method=pm_1TtzJ3KuuB1fWySndZ3Z2jpK&payment_method_types[0]=card&capture_method=manual
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/19.3.0
      Authorization:
      - "<HIDDEN-AUTHORIZATION-HEADER>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_EDY0YZpJDp8N51","request_duration_ms":431}}'
      Idempotency-Key:
      - 9f53e0ef-b769-45bc-b391-6eb0a2111970
      Stripe-Version:
      - 2026-06-24.dahlia
      X-Stripe-Client-User-Agent:
      - "<HIDDEN-STRIPE-USER-AGENT>"
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 17 Jul 2026 00:07:10 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1483'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=-AsR8-QoUz5vPqfjpWoX3LXqvm03tVT2tko6dgREouaydBH7ad4ePu_DivmkdBtYlprnrjpF1OLphVYd;
        report-to csp
      Idempotency-Key:
      - 9f53e0ef-b769-45bc-b391-6eb0a2111970
      Original-Request:
      - req_9xZ8ZjFt8vrqIp
      Report-To:
      - '{"group":"csp","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/csp-report-v2?q=-AsR8-QoUz5vPqfjpWoX3LXqvm03tVT2tko6dgREouaydBH7ad4ePu_DivmkdBtYlprnrjpF1OLphVYd&t=1"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - csp="https://q.stripe.com/csp-report-v2?q=-AsR8-QoUz5vPqfjpWoX3LXqvm03tVT2tko6dgREouaydBH7ad4ePu_DivmkdBtYlprnrjpF1OLphVYd&t=1"
      Request-Id:
      - req_9xZ8ZjFt8vrqIp
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - 2026-06-24.dahlia
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - 3c3
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pi_3TtzJ3KuuB1fWySn0YpWjkQV",
          "object": "payment_intent",
          "amount": 100,
          "amount_capturable": 0,
          "amount_details": {
            "tip": {}
          },
          "amount_received": 0,
          "application": null,
          "application_fee_amount": null,
          "automatic_payment_methods": null,
          "canceled_at": null,
          "cancellation_reason": null,
          "capture_method": "manual",
          "client_secret": "<HIDDEN-CLIENT-SECRET>",
          "confirmation_method": "automatic",
          "created": 1784246829,
          "currency": "aud",
          "customer": null,
          "customer_account": null,
          "description": null,
          "excluded_payment_method_types": null,
          "last_payment_error": null,
          "latest_charge": null,
          "livemode": false,
          "managed_payments": {
            "enabled": false
          },
          "metadata": {},
          "next_action": null,
          "on_behalf_of": null,
          "payment_method": "pm_1TtzJ3KuuB1fWySndZ3Z2jpK",
          "payment_method_configuration_details": null,
          "payment_method_options": {
            "card": {
              "installments": null,
              "mandate_options": null,
              "network": null,
              "request_three_d_secure": "automatic"
            }
          },
          "payment_method_types": [
            "card"
          ],
          "processing": null,
          "receipt_email": null,
          "review": null,
          "setup_future_usage": null,
          "shared_payment_granted_token": null,
          "shipping": null,
          "source": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": null,
          "status": "requires_confirmation",
          "transfer_data": null,
          "transfer_group": null
        }
  recorded_at: Fri, 17 Jul 2026 00:07:58 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/payment_intents/pi_3TtzJ3KuuB1fWySn0YpWjkQV
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/19.3.0
      Authorization:
      - "<HIDDEN-AUTHORIZATION-HEADER>"
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_9xZ8ZjFt8vrqIp","request_duration_ms":404}}'
      Stripe-Version:
      - 2026-06-24.dahlia
      X-Stripe-Client-User-Agent:
      - "<HIDDEN-STRIPE-USER-AGENT>"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 17 Jul 2026 00:07:10 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1483'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=-AsR8-QoUz5vPqfjpWoX3LXqvm03tVT2tko6dgREouaydBH7ad4ePu_DivmkdBtYlprnrjpF1OLphVYd;
        report-to csp
      Report-To:
      - '{"group":"csp","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/csp-report-v2?q=-AsR8-QoUz5vPqfjpWoX3LXqvm03tVT2tko6dgREouaydBH7ad4ePu_DivmkdBtYlprnrjpF1OLphVYd&t=1"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - csp="https://q.stripe.com/csp-report-v2?q=-AsR8-QoUz5vPqfjpWoX3LXqvm03tVT2tko6dgREouaydBH7ad4ePu_DivmkdBtYlprnrjpF1OLphVYd&t=1"
      Request-Id:
      - req_P3ip03ms7H60Ya
      Stripe-Version:
      - 2026-06-24.dahlia
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - 3c3
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "pi_3TtzJ3KuuB1fWySn0YpWjkQV",
          "object": "payment_intent",
          "amount": 100,
          "amount_capturable": 0,
          "amount_details": {
            "tip": {}
          },
          "amount_received": 0,
          "application": null,
          "application_fee_amount": null,
          "automatic_payment_methods": null,
          "canceled_at": null,
          "cancellation_reason": null,
          "capture_method": "manual",
          "client_secret": "<HIDDEN-CLIENT-SECRET>",
          "confirmation_method": "automatic",
          "created": 1784246829,
          "currency": "aud",
          "customer": null,
          "customer_account": null,
          "description": null,
          "excluded_payment_method_types": null,
          "last_payment_error": null,
          "latest_charge": null,
          "livemode": false,
          "managed_payments": {
            "enabled": false
          },
          "metadata": {},
          "next_action": null,
          "on_behalf_of": null,
          "payment_method": "pm_1TtzJ3KuuB1fWySndZ3Z2jpK",
          "payment_method_configuration_details": null,
          "payment_method_options": {
            "card": {
              "installments": null,
              "mandate_options": null,
              "network": null,
              "request_three_d_secure": "automatic"
            }
          },
          "payment_method_types": [
            "card"
          ],
          "processing": null,
          "receipt_email": null,
          "review": null,
          "setup_future_usage": null,
          "shared_payment_granted_token": null,
          "shipping": null,
          "source": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": null,
          "status": "requires_confirmation",
          "transfer_data": null,
          "transfer_group": null
        }
  recorded_at: Fri, 17 Jul 2026 00:07:58 GMT
recorded_with: VCR 6.4.0
